### 1. Ordinal Number Encoding

In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2021, 11, 26, 17, 58, 3, 141739)

In [4]:
#lets check 3 days backtime
today_date-datetime.timedelta(3)

datetime.datetime(2021, 11, 23, 17, 58, 3, 141739)

In [5]:
#lets check the last 15 days with list comprehention

In [6]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [7]:
#Lets save that into dataframe

In [8]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=['days']

In [9]:
data.head()

                        days
0 2021-11-26 17:58:03.141739
1 2021-11-25 17:58:03.141739
2 2021-11-24 17:58:03.141739
3 2021-11-23 17:58:03.141739
4 2021-11-22 17:58:03.141739

In [10]:
#Lets add weekday columns to identify the days
data['weekday']=data['days'].dt.weekday
data.head()

                        days  weekday
0 2021-11-26 17:58:03.141739        4
1 2021-11-25 17:58:03.141739        3
2 2021-11-24 17:58:03.141739        2
3 2021-11-23 17:58:03.141739        1
4 2021-11-22 17:58:03.141739        0

In [11]:
data.head()

                        days  weekday
0 2021-11-26 17:58:03.141739        4
1 2021-11-25 17:58:03.141739        3
2 2021-11-24 17:58:03.141739        2
3 2021-11-23 17:58:03.141739        1
4 2021-11-22 17:58:03.141739        0

In [12]:
dict={'Monday':1,"Tuesday":2,'Wedneshday':3,'Thursday':4,'Friday':5,'Saturday':6,'sunday':7}
dict

{'Monday': 1,
 'Tuesday': 2,
 'Wedneshday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'sunday': 7}

In [13]:
data

                         days  weekday
0  2021-11-26 17:58:03.141739        4
1  2021-11-25 17:58:03.141739        3
2  2021-11-24 17:58:03.141739        2
3  2021-11-23 17:58:03.141739        1
4  2021-11-22 17:58:03.141739        0
5  2021-11-21 17:58:03.141739        6
6  2021-11-20 17:58:03.141739        5
7  2021-11-19 17:58:03.141739        4
8  2021-11-18 17:58:03.141739        3
9  2021-11-17 17:58:03.141739        2
10 2021-11-16 17:58:03.141739        1
11 2021-11-15 17:58:03.141739        0
12 2021-11-14 17:58:03.141739        6
13 2021-11-13 17:58:03.141739        5
14 2021-11-12 17:58:03.141739        4

In [14]:
data['Weekday_name']=data['weekday'].map(dict)

In [15]:
data.head()

                        days  weekday  Weekday_name
0 2021-11-26 17:58:03.141739        4           NaN
1 2021-11-25 17:58:03.141739        3           NaN
2 2021-11-24 17:58:03.141739        2           NaN
3 2021-11-23 17:58:03.141739        1           NaN
4 2021-11-22 17:58:03.141739        0           NaN

### 2. Count Freequency Encoding

In [16]:
import pandas as pd

In [17]:
train=pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data",header=None,index_col=None)
train.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [18]:
columns=[1,3,5,6,7,8,9,13]
columns

[1, 3, 5, 6, 7, 8, 9, 13]

In [19]:
train=train[columns]
train.head()

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [20]:
# Now lets give names to this columns
train.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']
train.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [21]:
#lets check the unique labels

In [22]:
for feature in train.columns[:]:
    print(feature,":",len(train[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [23]:
country_map=train['Country'].value_counts().to_dict()

In [24]:
train['Country']=train['Country'].map(country_map)
train.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantages
1. Easy To Use
2. Not increasing feature space 

##### Disadvantages
1. It will provide same weight if the frequencies are same####

### 3. Target Guided Ordinal Encoding

1. Ordering the labels according to the target
2. Replace the labels by the join probability of being 1 or 0

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanic_train.csv",usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [3]:
# Now we will replace the NAN with Missing 
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [4]:
#lets take first letter of the value Cabin column
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [5]:
#lets check the unique values of Cabin
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [6]:
#lets check the probability of the person to get survived on a particular cabin

In [7]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [8]:
#lets take the indexes only  
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [9]:
enumerate(ordinal_labels,0)

In [10]:
#Dictionary comphrehention

In [11]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [13]:
df['Cabin_frequent_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_frequent_labels
0         0     M                      1
1         1     C                      4
2         1     M                      1
3         1     C                      4
4         0     M                      1

### 4. Mean Encoding 

here we are converting the categorical values with mean of the feature

In [15]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [16]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_frequent_labels  mean_ordinal_encode
0         0     M                      1             0.299854
1         1     C                      4             0.593220
2         1     M                      1             0.299854
3         1     C                      4             0.593220
4         0     M                      1             0.299854